src/CF/InformationRegisters/НоменклатураЧастогоСпроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураЧастогоСпроса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/НоменклатураЧастогоСпроса/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//sza131029-1659  

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Если Запись.Позиция = 0 Тогда
		Запись.Позиция = ПолучитьСледующуюПозицию();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьСледующуюПозицию()
	
	результат = 0;
	
	Для позиция = 1 по 99 цикл 
		если нетпозиции(позиция) тогда
			результат = позиция;
			прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //ПолучитьСледующуюПозици()

Функция   нетпозиции(позиция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураЧастогоСпроса.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураЧастогоСпроса КАК НоменклатураЧастогоСпроса
	|ГДЕ
	|	НоменклатураЧастогоСпроса.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("Позиция", Позиция);
	
	Если  Запрос.Выполнить().Пустой() тогда
		возврат истина;
	иначе
		возврат ложь;
	КонецЕсли;
	
КонецФункции //нетпозиции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры
